MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18324/mcu.h
// Register: CWG2CON0
#define CWG2CON0 CWG2CON0
extern volatile unsigned char           CWG2CON0            __at(0x715);
#ifndef _LIB_BUILD
asm("CWG2CON0 equ 0715h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned                        :3;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned G2EN                   :1;
    };
    struct {
        unsigned CWG2MODE               :3;
        unsigned                        :3;
        unsigned CWG2LD                 :1;
        unsigned CWG2EN                 :1;
    };
    struct {
        unsigned CWG2MODE0              :1;
        unsigned CWG2MODE1              :1;
        unsigned CWG2MODE2              :1;
    };
} CWG2CON0bits_t;
extern volatile CWG2CON0bits_t CWG2CON0bits __at(0x715);
// bitfield macros
#define _CWG2CON0_MODE_POSN                                 0x0
#define _CWG2CON0_MODE_POSITION                             0x0
#define _CWG2CON0_MODE_SIZE                                 0x3
#define _CWG2CON0_MODE_LENGTH                               0x3
#define _CWG2CON0_MODE_MASK                                 0x7
#define _CWG2CON0_LD_POSN                                   0x6
#define _CWG2CON0_LD_POSITION                               0x6
#define _CWG2CON0_LD_SIZE                                   0x1
#define _CWG2CON0_LD_LENGTH                                 0x1
#define _CWG2CON0_LD_MASK                                   0x40
#define _CWG2CON0_EN_POSN                                   0x7
#define _CWG2CON0_EN_POSITION                               0x7
#define _CWG2CON0_EN_SIZE                                   0x1
#define _CWG2CON0_EN_LENGTH                                 0x1
#define _CWG2CON0_EN_MASK                                   0x80
#define _CWG2CON0_MODE0_POSN                                0x0
#define _CWG2CON0_MODE0_POSITION                            0x0
#define _CWG2CON0_MODE0_SIZE                                0x1
#define _CWG2CON0_MODE0_LENGTH                              0x1
#define _CWG2CON0_MODE0_MASK                                0x1
#define _CWG2CON0_MODE1_POSN                                0x1
#define _CWG2CON0_MODE1_POSITION                            0x1
#define _CWG2CON0_MODE1_SIZE                                0x1
#define _CWG2CON0_MODE1_LENGTH                              0x1
#define _CWG2CON0_MODE1_MASK                                0x2
#define _CWG2CON0_MODE2_POSN                                0x2
#define _CWG2CON0_MODE2_POSITION                            0x2
#define _CWG2CON0_MODE2_SIZE                                0x1
#define _CWG2CON0_MODE2_LENGTH                              0x1
#define _CWG2CON0_MODE2_MASK                                0x4
#define _CWG2CON0_G2EN_POSN                                 0x7
#define _CWG2CON0_G2EN_POSITION                             0x7
#define _CWG2CON0_G2EN_SIZE                                 0x1
#define _CWG2CON0_G2EN_LENGTH                               0x1
#define _CWG2CON0_G2EN_MASK                                 0x80
#define _CWG2CON0_CWG2MODE_POSN                             0x0
#define _CWG2CON0_CWG2MODE_POSITION                         0x0
#define _CWG2CON0_CWG2MODE_SIZE                             0x3
#define _CWG2CON0_CWG2MODE_LENGTH                           0x3
#define _CWG2CON0_CWG2MODE_MASK                             0x7
#define _CWG2CON0_CWG2LD_POSN                               0x6
#define _CWG2CON0_CWG2LD_POSITION                           0x6
#define _CWG2CON0_CWG2LD_SIZE                               0x1
#define _CWG2CON0_CWG2LD_LENGTH                             0x1
#define _CWG2CON0_CWG2LD_MASK                               0x40
#define _CWG2CON0_CWG2EN_POSN                               0x7
#define _CWG2CON0_CWG2EN_POSITION                           0x7
#define _CWG2CON0_CWG2EN_SIZE                               0x1
#define _CWG2CON0_CWG2EN_LENGTH                             0x1
#define _CWG2CON0_CWG2EN_MASK                               0x80
#define _CWG2CON0_CWG2MODE0_POSN                            0x0
#define _CWG2CON0_CWG2MODE0_POSITION                        0x0
#define _CWG2CON0_CWG2MODE0_SIZE                            0x1
#define _CWG2CON0_CWG2MODE0_LENGTH                          0x1
#define _CWG2CON0_CWG2MODE0_MASK                            0x1
#define _CWG2CON0_CWG2MODE1_POSN                            0x1
#define _CWG2CON0_CWG2MODE1_POSITION                        0x1
#define _CWG2CON0_CWG2MODE1_SIZE                            0x1
#define _CWG2CON0_CWG2MODE1_LENGTH                          0x1
#define _CWG2CON0_CWG2MODE1_MASK                            0x2
#define _CWG2CON0_CWG2MODE2_POSN                            0x2
#define _CWG2CON0_CWG2MODE2_POSITION                        0x2
#define _CWG2CON0_CWG2MODE2_SIZE                            0x1
#define _CWG2CON0_CWG2MODE2_LENGTH                          0x1
#define _CWG2CON0_CWG2MODE2_MASK                            0x4

// Register: CWG2CON1
#define CWG2CON1 CWG2CON1
extern volatile unsigned char           CWG2CON1            __at(0x716);
#ifndef _LIB_BUILD
asm("CWG2CON1 equ 0716h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :1;
        unsigned IN                     :1;
    };
    struct {
        unsigned CWG2POLA               :1;
        unsigned CWG2POLB               :1;
        unsigned CWG2POLC               :1;
        unsigned CWG2POLD               :1;
        unsigned                        :1;
        unsigned CWG2IN                 :1;
    };
} CWG2CON1bits_t;
extern volatile CWG2CON1bits_t CWG2CON1bits __at(0x716);
// bitfield macros
#define _CWG2CON1_POLA_POSN                                 0x0
#define _CWG2CON1_POLA_POSITION                             0x0
#define _CWG2CON1_POLA_SIZE                                 0x1
#define _CWG2CON1_POLA_LENGTH                               0x1
#define _CWG2CON1_POLA_MASK                                 0x1
#define _CWG2CON1_POLB_POSN                                 0x1
#define _CWG2CON1_POLB_POSITION                             0x1
#define _CWG2CON1_POLB_SIZE                                 0x1
#define _CWG2CON1_POLB_LENGTH                               0x1
#define _CWG2CON1_POLB_MASK                                 0x2
#define _CWG2CON1_POLC_POSN                                 0x2
#define _CWG2CON1_POLC_POSITION                             0x2
#define _CWG2CON1_POLC_SIZE                                 0x1
#define _CWG2CON1_POLC_LENGTH                               0x1
#define _CWG2CON1_POLC_MASK                                 0x4
#define _CWG2CON1_POLD_POSN                                 0x3
#define _CWG2CON1_POLD_POSITION                             0x3
#define _CWG2CON1_POLD_SIZE                                 0x1
#define _CWG2CON1_POLD_LENGTH                               0x1
#define _CWG2CON1_POLD_MASK                                 0x8
#define _CWG2CON1_IN_POSN                                   0x5
#define _CWG2CON1_IN_POSITION                               0x5
#define _CWG2CON1_IN_SIZE                                   0x1
#define _CWG2CON1_IN_LENGTH                                 0x1
#define _CWG2CON1_IN_MASK                                   0x20
#define _CWG2CON1_CWG2POLA_POSN                             0x0
#define _CWG2CON1_CWG2POLA_POSITION                         0x0
#define _CWG2CON1_CWG2POLA_SIZE                             0x1
#define _CWG2CON1_CWG2POLA_LENGTH                           0x1
#define _CWG2CON1_CWG2POLA_MASK                             0x1
#define _CWG2CON1_CWG2POLB_POSN                             0x1
#define _CWG2CON1_CWG2POLB_POSITION                         0x1
#define _CWG2CON1_CWG2POLB_SIZE                             0x1
#define _CWG2CON1_CWG2POLB_LENGTH                           0x1
#define _CWG2CON1_CWG2POLB_MASK                             0x2
#define _CWG2CON1_CWG2POLC_POSN                             0x2
#define _CWG2CON1_CWG2POLC_POSITION                         0x2
#define _CWG2CON1_CWG2POLC_SIZE                             0x1
#define _CWG2CON1_CWG2POLC_LENGTH                           0x1
#define _CWG2CON1_CWG2POLC_MASK                             0x4
#define _CWG2CON1_CWG2POLD_POSN                             0x3
#define _CWG2CON1_CWG2POLD_POSITION                         0x3
#define _CWG2CON1_CWG2POLD_SIZE                             0x1
#define _CWG2CON1_CWG2POLD_LENGTH                           0x1
#define _CWG2CON1_CWG2POLD_MASK                             0x8
#define _CWG2CON1_CWG2IN_POSN                               0x5
#define _CWG2CON1_CWG2IN_POSITION                           0x5
#define _CWG2CON1_CWG2IN_SIZE                               0x1
#define _CWG2CON1_CWG2IN_LENGTH                             0x1
#define _CWG2CON1_CWG2IN_MASK                               0x20

// Register: CWG2AS0
#define CWG2AS0 CWG2AS0
extern volatile unsigned char           CWG2AS0             __at(0x717);
#ifndef _LIB_BUILD
asm("CWG2AS0 equ 0717h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSBD                   :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG2LSAC               :2;
        unsigned CWG2LSBD               :2;
        unsigned CWG2REN                :1;
        unsigned CWG2SHUTDOWN           :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG2LSAC0              :1;
        unsigned CWG2LSAC1              :1;
        unsigned CWG2LSBD0              :1;
        unsigned CWG2LSBD1              :1;
    };
} CWG2AS0bits_t;
extern volatile CWG2AS0bits_t CWG2AS0bits __at(0x717);
// bitfield macros
#define _CWG2AS0_LSAC_POSN                                  0x2
#define _CWG2AS0_LSAC_POSITION                              0x2
#define _CWG2AS0_LSAC_SIZE                                  0x2
#define _CWG2AS0_LSAC_LENGTH                                0x2
#define _CWG2AS0_LSAC_MASK                                  0xC
#define _CWG2AS0_LSBD_POSN                                  0x4
#define _CWG2AS0_LSBD_POSITION                              0x4
#define _CWG2AS0_LSBD_SIZE                                  0x2
#define _CWG2AS0_LSBD_LENGTH                                0x2
#define _CWG2AS0_LSBD_MASK                                  0x30
#define _CWG2AS0_REN_POSN                                   0x6
#define _CWG2AS0_REN_POSITION                               0x6
#define _CWG2AS0_REN_SIZE                                   0x1
#define _CWG2AS0_REN_LENGTH                                 0x1
#define _CWG2AS0_REN_MASK                                   0x40
#define _CWG2AS0_SHUTDOWN_POSN                              0x7
#define _CWG2AS0_SHUTDOWN_POSITION                          0x7
#define _CWG2AS0_SHUTDOWN_SIZE                              0x1
#define _CWG2AS0_SHUTDOWN_LENGTH                            0x1
#define _CWG2AS0_SHUTDOWN_MASK                              0x80
#define _CWG2AS0_LSAC0_POSN                                 0x2
#define _CWG2AS0_LSAC0_POSITION                             0x2
#define _CWG2AS0_LSAC0_SIZE                                 0x1
#define _CWG2AS0_LSAC0_LENGTH                               0x1
#define _CWG2AS0_LSAC0_MASK                                 0x4
#define _CWG2AS0_LSAC1_POSN                                 0x3
#define _CWG2AS0_LSAC1_POSITION                             0x3
#define _CWG2AS0_LSAC1_SIZE                                 0x1
#define _CWG2AS0_LSAC1_LENGTH                               0x1
#define _CWG2AS0_LSAC1_MASK                                 0x8
#define _CWG2AS0_LSBD0_POSN                                 0x4
#define _CWG2AS0_LSBD0_POSITION                             0x4
#define _CWG2AS0_LSBD0_SIZE                                 0x1
#define _CWG2AS0_LSBD0_LENGTH                               0x1
#define _CWG2AS0_LSBD0_MASK                                 0x10
#define _CWG2AS0_LSBD1_POSN                                 0x5
#define _CWG2AS0_LSBD1_POSITION                             0x5
#define _CWG2AS0_LSBD1_SIZE                                 0x1
#define _CWG2AS0_LSBD1_LENGTH                               0x1
#define _CWG2AS0_LSBD1_MASK                                 0x20
#define _CWG2AS0_CWG2LSAC_POSN                              0x2
#define _CWG2AS0_CWG2LSAC_POSITION                          0x2
#define _CWG2AS0_CWG2LSAC_SIZE                              0x2
#define _CWG2AS0_CWG2LSAC_LENGTH                            0x2
#define _CWG2AS0_CWG2LSAC_MASK                              0xC
#define _CWG2AS0_CWG2LSBD_POSN                              0x4
#define _CWG2AS0_CWG2LSBD_POSITION                          0x4
#define _CWG2AS0_CWG2LSBD_SIZE                              0x2
#define _CWG2AS0_CWG2LSBD_LENGTH                            0x2
#define _CWG2AS0_CWG2LSBD_MASK                              0x30
#define _CWG2AS0_CWG2REN_POSN                               0x6
#define _CWG2AS0_CWG2REN_POSITION                           0x6
#define _CWG2AS0_CWG2REN_SIZE                               0x1
#define _CWG2AS0_CWG2REN_LENGTH                             0x1
#define _CWG2AS0_CWG2REN_MASK                               0x40
#define _CWG2AS0_CWG2SHUTDOWN_POSN                          0x7
#define _CWG2AS0_CWG2SHUTDOWN_POSITION                      0x7
#define _CWG2AS0_CWG2SHUTDOWN_SIZE                          0x1
#define _CWG2AS0_CWG2SHUTDOWN_LENGTH                        0x1
#define _CWG2AS0_CWG2SHUTDOWN_MASK                          0x80
#define _CWG2AS0_CWG2LSAC0_POSN                             0x2
#define _CWG2AS0_CWG2LSAC0_POSITION                         0x2
#define _CWG2AS0_CWG2LSAC0_SIZE                             0x1
#define _CWG2AS0_CWG2LSAC0_LENGTH                           0x1
#define _CWG2AS0_CWG2LSAC0_MASK                             0x4
#define _CWG2AS0_CWG2LSAC1_POSN                             0x3
#define _CWG2AS0_CWG2LSAC1_POSITION                         0x3
#define _CWG2AS0_CWG2LSAC1_SIZE                             0x1
#define _CWG2AS0_CWG2LSAC1_LENGTH                           0x1
#define _CWG2AS0_CWG2LSAC1_MASK                             0x8
#define _CWG2AS0_CWG2LSBD0_POSN                             0x4
#define _CWG2AS0_CWG2LSBD0_POSITION                         0x4
#define _CWG2AS0_CWG2LSBD0_SIZE                             0x1
#define _CWG2AS0_CWG2LSBD0_LENGTH                           0x1
#define _CWG2AS0_CWG2LSBD0_MASK                             0x10
#define _CWG2AS0_CWG2LSBD1_POSN                             0x5
#define _CWG2AS0_CWG2LSBD1_POSITION                         0x5
#define _CWG2AS0_CWG2LSBD1_SIZE                             0x1
#define _CWG2AS0_CWG2LSBD1_LENGTH                           0x1
#define _CWG2AS0_CWG2LSBD1_MASK                             0x20

